app/Controllers/Categorias.php

SELECT *
FROM `categorias`
WHERE `activo` = 1
---
    public function index($activo = 1)
    {
        // Buscar todos los registros activos
        $categorias = $this->categorias->where('activo', $activo)->findAll();

SELECT *
FROM `categorias`
WHERE `activo` = 0
---
    public function eliminados($activo = 0)
    {
        // Buscar todos los registros activos
        $categorias = $this->categorias->where('activo', $activo)->findAll();

INSERT INTO `categorias` (`nombre`, `created_at`, `updated_at`) VALUES ('productos 2', '2023-12-13 17:12:51', '2023-12-13 17:12:51')
---
    public function insertar()
    {
        $this->categorias->save([
            'nombre' => $this->request->getPost('nombre')
        ]);

SELECT *
FROM `categorias`
WHERE `id` = '1'
 LIMIT 1
---
    public function editar($id)
    {
        // Busca el primer registro que encuentre con ese id
        $categoria = $this->categorias->where('id', $id)->first();

UPDATE `categorias` SET `activo` = 0, `updated_at` = '2023-12-13 17:12:56'
WHERE `categorias`.`id` IN ('7')
---
    public function eliminar($id)
    {
        // Recoger el id de hidden y pasa el activo a 0
        $this->categorias->update($id, ['activo' => 0]);